Tekla Open API Reference for Tekla Structures 2025
RebarComplexGeometry.Legs Property
 Gets the list of RebarLegs of the bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarLeg> Legs { get; }
Public ReadOnly Property Legs As List(Of RebarLeg)
	Get
Property Value
Type: List<RebarLeg>
See Also
Reference
RebarComplexGeometry Class
Tekla.Structures.Model Namespace